import pandas as pd
def sample_data(sample_name):
    # Define sample data based on the requested sample
    if sample_name == 'main_data_sample':
        data = {
            "보험사+업적월+상품군 key": ["보험사명/202307", "보험사명/202307", "보험사명/202307"],
            "마감월": [202406, 202406, 202406],
            "보험사": ["보험사명", "보험사명", "보험사명"]
        }
    elif sample_name == 'support_data_sample':
        data = {
            "마감월": ["202406", "202406", "202406"],
            "보험사": ["보험사명", "보험사명", "보험사명"],
            "모집인코드": [1234, 1234, 1234],
            "증권번호": [1234, 1234, 1234],
            "계약일": ["2024-03-29", "2024-03-29", "2024-06-29"],
            "처리납입방법": ["월납", "월납", "월납"],
            "처리계약상태": ["정상", "정상", "정상"],
            "처리납입회차": [4, 4, 1],
            "계산방식": ["유지", "유지", "신계약"],
            "보험료": [255976, 85776, 350178],
            "월납화 보험료": [255976, 85776, 350178],
            "정산성적": [0, 0, 632158],
            "환산성적1": [303667, 140683, 632158],
            "환산성적2": [0, 0, 632158],
            "환산성적3": [0, 0, 632158],
            "성과": [0, 0, 2844711],
            "계약관리": [0, 0, 0],
            "수금": [0, 0, 0],
            "운영": [0, 0, 0],
            "기타": [0, 0, 0],
            "합계": [0, 0, 2844711],
            "납입기간": [0, 0, 0],
            "상품군": ["", "", "보장성"],
            "상품코드": [1234, 1234, 1234],
            "상품명": ["", "", "상품명"],
            "계약자": ["", "", "주식회사 금송산업개"],
            "피보험자": ["abc", "abc", "천순희"],
            "태아회차": ["", "", ""],
            "태아여부": ["", "", ""],
            "ERP사번": [1234, 1234, 1234],
            "사원명": ["사원명", "사원명", "사원명"],
            "모집인 소속경로_사업단": ["", "", ""],
            "모집인 소속경로_지점/팀": ["", "", ""]
        }

# Creating DataFrame

    else:
        return "Invalid sample name", 404

    # Create a DataFrame
    df = pd.DataFrame(data)
    return df
